export default (() => {
    const items = [
        {
            id: 9,
            title: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
            image: '/images/4.jpg',
            album: [
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
            ],
        },
        {
            id: 1,
            title: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
            image: '/images/4.jpg',
            album: [
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
            ],
        },
        {
            id: 2,
            title: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
            image: '/images/4.jpg',
            album: [
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
            ],
        },
        {
            id: 3,
            title: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
            image: '/images/4.jpg',
            album: [
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
            ],
        },
        {
            id: 4,
            title: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
            image: '/images/4.jpg',
            album: [
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
            ],
        },
        {
            id: 5,
            title: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
            image: '/images/4.jpg',
            album: [
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
            ],
        },
        {
            id: 6,
            title: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
            image: '/images/4.jpg',
            album: [
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
            ],
        },
        {
            id: 7,
            title: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
            image: '/images/4.jpg',
            album: [
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
            ],
        },
        {
            id: 8,
            title: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
            image: '/images/4.jpg',
            album: [
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
            ],
        },
        {
            id: 10,
            title: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
            image: '/images/4.jpg',
            album: [
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
                {
                    path: '/images/4.jpg',
                    caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
                },
            ],
        },

    ];
    return (num) => {
        let arr = [];
        let indexes = [];
        for (let i = 0; i < num; i++) {
            let index;
            do {
                index = Math.floor(Math.random() * Math.floor(items.length));
            }
            while (indexes.includes(index));
            indexes.push(index);
            arr.push(items[index]);
        }
        return num === 1 ? arr[0] : arr;
    };
})();
