export default (() => {
    const item = {
        id: 3,
        title: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو 1',
        image: '/images/6.jpg',
        url: '/details/3',
        time_ago: 'منذ ٤ دقائق',
        excerpt: 'بيساو – أشرف صاحب الجلالة الملك محمد السادس ، نصره الله ، مرفوقا برئيس جمهورية غينيا بيساو السيد جوزي ماريو فاز ، اليوم الخميس بالقصر الرئاسي ببيساو ، على تسليم تجهيزات لتربية الماشية منحتها المملكة المغربية للحفاظ على القطيع في غينيا بيساو.',
        category_name: 'الخليج 1',
        category_url: '/category/gulf',
        content: `<p> أشرف صاحب الجلالة الملك محمد السادس ، نصره الله ، مرفوقا برئيس جمهورية غينيا
                    بيساو السيد جوزي ماريو فاز ، اليوم الخميس بالقصر الرئاسي ببيساو ، على تسليم
                    تجهيزات لحماية الماشية لغينيا بيساو هبة من المملكة المغربية. أشرف صاحب الجلالة
                    الملك محمد السادس ، نصره الله ، مرفوقا برئيس جمهورية غينيا بيساو السيد جوزي
                    ماريو فاز ، اليوم الخميس بالقصر الرئاسي ببيساو ، على تسليم تجهيزات لحماية
                    الماشية لغينيا بيساو هبة من المملكة المغربية.أشرف صاحب الجلالة الملك محمد السادس
                    ، نصره الله ، مرفوقا برئيس جمهورية غينيا بيساو السيد جوزي ماريو فاز ، اليوم
                    الخميس بالقصر الرئاسي ببيساو ، على تسليم تجهيزات لحماية الماشية لغينيا بيساو هبة
                    من المملكة المغربية.أشرف صاحب الجلالة الملك محمد السادس ، نصره الله ، مرفوقا
                    برئيس جمهورية غينيا بيساو السيد جوزي ماريو فاز ، اليوم الخميس بالقصر الرئاسي
                    ببيساو ، على تسليم تجهيزات لحماية الماشية لغينيا بيساو هبة من المملكة
                    المغربية.أشرف صاحب الجلالة الملك محمد السادس ، نصره الله ، مرفوقا برئيس جمهورية
                    غينيا بيساو السيد جوزي ماريو فاز ، اليوم الخميس بالقصر الرئاسي ببيساو ، على
                    تسليم تجهيزات لحماية الماشية لغينيا بيساو هبة من المملكة المغربية.أشرف صاحب
                    الجلالة الملك محمد السادس ، نصره الله ، مرفوقا برئيس جمهورية غينيا بيساو السيد
                    جوزي ماريو فاز ، اليوم الخميس بالقصر الرئاسي ببيساو ، على تسليم تجهيزات لحماية
                    الماشية لغينيا بيساو هبة </p>
                <p> أشرف صاحب الجلالة الملك محمد السادس ، نصره الله ، مرفوقا برئيس جمهورية غينيا
                    بيساو السيد جوزي ماريو فاز ، اليوم الخميس بالقصر الرئاسي ببيساو ، على تسليم
                    تجهيزات لحماية الماشية لغينيا بيساو هبة من المملكة المغربية. أشرف صاحب الجلالة
                    الملك محمد السادس ، نصره الله ، مرفوقا برئيس جمهورية غينيا بيساو السيد جوزي
                    ماريو فاز ، اليوم الخميس بالقصر الرئاسي ببيساو ، على تسليم تجهيزات لحماية
                    الماشية لغينيا بيساو هبة من المملكة المغربية.أشرف صاحب الجلالة الملك محمد السادس
                    ، نصره الله ، مرفوقا برئيس جمهورية غينيا بيساو السيد جوزي ماريو فاز ، اليوم
                    الخميس بالقصر الرئاسي ببيساو ، على تسليم تجهيزات لحماية الماشية لغينيا بيساو هبة
                    من المملكة المغربية.أشرف صاحب الجلالة الملك محمد السادس ، نصره الله ، مرفوقا
                    برئيس جمهورية غينيا بيساو السيد جوزي ماريو فاز ، اليوم الخميس بالقصر الرئاسي
                    ببيساو ، على تسليم تجهيزات لحماية الماشية لغينيا بيساو هبة من المملكة
                    المغربية.أشرف صاحب الجلالة الملك محمد السادس ، نصره الله ، مرفوقا برئيس جمهورية
                    غينيا بيساو السيد جوزي ماريو فاز ، اليوم الخميس بالقصر الرئاسي ببيساو ، على
                    تسليم تجهيزات لحماية الماشية لغينيا بيساو هبة من المملكة المغربية.أشرف صاحب
                    الجلالة الملك محمد السادس ، نصره الله ، مرفوقا برئيس جمهورية غينيا بيساو السيد
                    جوزي ماريو فاز ، اليوم الخميس بالقصر الرئاسي ببيساو ، على تسليم تجهيزات لحماية
                    الماشية لغينيا بيساو هبة </p>`,
        tags: [
            {
                id: '1',
                name: '#الملك محمد السادس',
            },
            {
                id: '2',
                name: '#إقتصاد',
            },
            {
                id: '3',
                name: '#إقتصاد',
            },
        ],
        full_url: 'http://aldar.test/details/1',
        video_embed: 'https://www.youtube.com/embed/ejvpVhvKesM?rel=0&amp;showinfo=0;',
        album: [
            {
                path: '/images/4.jpg',
                caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
            },
            {
                path: '/images/4.jpg',
                caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
            },
            {
                path: '/images/4.jpg',
                caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
            },
            {
                path: '/images/4.jpg',
                caption: 'جلالة الملك يسلم تجهيزات خاصة لحماية الماشية هبة من المغرب لغينيا بيساو',
            },
        ],
        share_url: 'http://aldar.test/details/1',
    };
    return () => {
        return item;
    };
})();
